Revit 2026 API

# EnergyAnalysisSurfaceCorner Property

---

The lower-left coordinate for the analytical rectangular geometry viewed from outside.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Corner { get; }
```
```vb
Public ReadOnly Property Corner As XYZ
	Get
```
```cpp
public:
property XYZ^ Corner {
	XYZ^ get ();
}
```
```fsharp
member Corner : XYZ with get
```

#### Property Value

XYZ

The analytical rectangular geometry is typically used in simulation engines.

#### Reference

EnergyAnalysisSurface Class

Autodesk.Revit.DB.Analysis Namespace